Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSS          (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSPCS        (0x3U<<0)
#define OTG2_HS_HOST_OTG_HS_HCFG_FSLSPCS_0      (0x1U<<0)

// OTG_HS_HFIR Configuration

#define OTG2_HS_HOST_OTG_HS_HFIR_FRIVL          (0xFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HFIR_FRIVL_0        (0x1U<<0)

// OTG_HS_HFNUM Configuration

#define OTG2_HS_HOST_OTG_HS_HFNUM_FTREM         (0xFFFFU<<16)
#define OTG2_HS_HOST_OTG_HS_HFNUM_FTREM_0       (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HFNUM_FRNUM         (0xFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HFNUM_FRNUM_0       (0x1U<<0)

// OTG_HS_HPTXSTS Configuration

#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP     (0xFFU<<24)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQTOP_0   (0x1U<<24)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV     (0xFFU<<16)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXQSAV_0   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL    (0xFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HPTXSTS_PTXFSAVL_0  (0x1U<<0)

// OTG_HS_HAINT Configuration

#define OTG2_HS_HOST_OTG_HS_HAINT_HAINT         (0xFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HAINT_HAINT_0       (0x1U<<0)

// OTG_HS_HAINTMSK Configuration

#define OTG2_HS_HOST_OTG_HS_HAINTMSK_HAINTM     (0xFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HAINTMSK_HAINTM_0   (0x1U<<0)

// OTG_HS_HPRT Configuration

#define OTG2_HS_HOST_OTG_HS_HPRT_PSPD           (0x3U<<17)
#define OTG2_HS_HOST_OTG_HS_HPRT_PSPD_0         (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HPRT_PTCTL          (0xFU<<13)
#define OTG2_HS_HOST_OTG_HS_HPRT_PTCTL_0        (0x1U<<13)
#define OTG2_HS_HOST_OTG_HS_HPRT_PPWR           (0x1U<<12)
#define OTG2_HS_HOST_OTG_HS_HPRT_PLSTS          (0x3U<<10)
#define OTG2_HS_HOST_OTG_HS_HPRT_PLSTS_0        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HPRT_PRST           (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HPRT_PSUSP          (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HPRT_PRES           (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HPRT_POCCHNG        (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HPRT_POCA           (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HPRT_PENCHNG        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HPRT_PENA           (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HPRT_PCDET          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HPRT_PCSTS          (0x1U<<0)

// OTG_HS_HCCHAR0 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR0_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR0_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT0 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT0_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT0_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT0 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT0_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT0_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT0_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT0_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT0_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT0_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT0_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT0_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT0_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT0_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT0_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK0 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK0_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ0 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA0 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA0_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA0_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR1 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR1_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR1_MPSIZ_0     (0x1U<<0)

