Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg2_hs_host.h
// OTG_HS_HCSPLT1 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT1_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT1_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT1 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT1_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT1_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT1_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT1_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT1_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT1_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT1_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT1_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT1_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT1_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT1_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK1 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK1_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ1 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA1 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA1_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA1_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR2 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR2_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR2_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT2 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT2_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT2_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT2 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT2_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT2_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT2_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT2_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT2_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT2_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT2_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT2_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT2_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT2_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT2_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK2 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK2_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ2 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA2 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA2_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA2_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR3 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT3 Configuration

