Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT5_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT5 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT5_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT5_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT5_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT5_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT5_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT5_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT5_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT5_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT5_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT5_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT5_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK5 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK5_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ5 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA5 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA5_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA5_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR6_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR6_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT6_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT6_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT6_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT6_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT6_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT6_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT6_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT6_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT6_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT6_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT6_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT6_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT6_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK6_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA6_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA6_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT7_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT7_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT7_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT7_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT7_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT7_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT7_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT7_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT7_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT7_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT7_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT7_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_XFRCM     (0x1U<<0)

