Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg2_hs_host.h
// OTG_HS_HCTSIZ7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA7_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA7_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT8_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT8_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT8_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT8_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT8_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT8_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT8_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT8_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT8_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT8_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT8_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT8_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA8_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA8_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT9_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT9_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT9_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT9_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT9_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT9_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT9_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT9_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT9_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT9_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT9_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT9_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA9_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA9_DMAADDR_0    (0x1U<<0)

