Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg2_hs_host.h
// OTG_HS_HCSPLT12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT12_SPLITEN    (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT  (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_XACTPOS    (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_0  (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_HUBADDR    (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_0  (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_PRTADDR    (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT12_DTERR       (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT12_FRMOR       (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT12_BBERR       (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT12_TXERR       (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT12_NYET        (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT12_ACK         (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT12_NAK         (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT12_STALL       (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT12_AHBERR      (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT12_CHH         (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT12_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_DTERRM   (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_FRMORM   (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_BBERRM   (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_TXERRM   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_NYET     (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_ACKM     (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_NAKM     (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_STALLM   (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_AHBERR   (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_CHHM     (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_DPID       (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_DPID_0     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT     (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_0   (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ     (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA12_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA12_DMAADDR_0   (0x1U<<0)

// OTG_HS_HCCHAR13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR13_CHENA      (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_CHDIS      (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_ODDFRM     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_DAD        (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_DAD_0      (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MC         (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MC_0       (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPTYP      (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPTYP_0    (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_LSDEV      (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPDIR      (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPNUM      (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPNUM_0    (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MPSIZ      (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT13_SPLITEN    (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT  (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_XACTPOS    (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_0  (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_HUBADDR    (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_0  (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_PRTADDR    (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT13_DTERR       (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT13_FRMOR       (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT13_BBERR       (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT13_TXERR       (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT13_NYET        (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT13_ACK         (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT13_NAK         (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT13_STALL       (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT13_AHBERR      (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT13_CHH         (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT13_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_DTERRM   (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_FRMORM   (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_BBERRM   (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_TXERRM   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_NYET     (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_ACKM     (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_NAKM     (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_STALLM   (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_AHBERR   (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_CHHM     (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_DPID       (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_DPID_0     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT     (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT_0   (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ     (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA13_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA13_DMAADDR_0   (0x1U<<0)

// OTG_HS_HCCHAR14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR14_CHENA      (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_CHDIS      (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_ODDFRM     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_DAD        (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_DAD_0      (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MC         (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MC_0       (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPTYP      (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPTYP_0    (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_LSDEV      (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPDIR      (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPNUM      (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPNUM_0    (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MPSIZ      (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT14_SPLITEN    (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT  (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_XACTPOS    (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_XACTPOS_0  (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_HUBADDR    (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_HUBADDR_0  (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_PRTADDR    (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT14_DTERR       (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT14_FRMOR       (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT14_BBERR       (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT14_TXERR       (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT14_NYET        (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT14_ACK         (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT14_NAK         (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT14_STALL       (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT14_AHBERR      (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT14_CHH         (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT14_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_DTERRM   (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_FRMORM   (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_BBERRM   (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_TXERRM   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_NYET     (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_ACKM     (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_NAKM     (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_STALLM   (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_AHBERR   (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_CHHM     (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_DPID       (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_DPID_0     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT     (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_0   (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ     (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA14_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA14_DMAADDR_0   (0x1U<<0)

// OTG_HS_HCCHAR15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR15_CHENA      (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_CHDIS      (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_ODDFRM     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_DAD        (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_DAD_0      (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MC         (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MC_0       (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPTYP      (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPTYP_0    (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_LSDEV      (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPDIR      (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPNUM      (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPNUM_0    (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MPSIZ      (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT15_SPLITEN    (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT  (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_XACTPOS    (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_0  (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_HUBADDR    (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_0  (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_PRTADDR    (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT15_DTERR       (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT15_FRMOR       (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT15_BBERR       (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT15_TXERR       (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT15_NYET        (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT15_ACK         (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT15_NAK         (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT15_STALL       (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT15_AHBERR      (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT15_CHH         (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT15_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_DTERRM   (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_FRMORM   (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_BBERRM   (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_TXERRM   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NYET     (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_ACKM     (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NAKM     (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_STALL    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_AHBERR   (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_CHHM     (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_DPID       (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_DPID_0     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT     (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_0   (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ     (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA15_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA15_DMAADDR_0   (0x1U<<0)
